src/testing/performance-test/test-case2/16gb/siege-200-users-pc.txt
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 120 seconds
** SIEGE 4.0.2
** Preparing 200 concurrent users for battle.
The server is now under siege...[error] socket: read error Connection reset by peer sock.c:539: Connection reset by peer

Lifting the server siege...
Transactions:		        8466 hits
Availability:		       99.99 %
Elapsed time:		      119.97 secs
Data transferred:	     1333.83 MB
Response time:		        2.52 secs
Transaction rate:	       70.57 trans/sec
Throughput:		       11.12 MB/sec
Concurrency:		      178.13
Successful transactions:        8466
Failed transactions:	           1
Longest transaction:	       62.33
Shortest transaction:	        0.13
 
Aborted